Autodesk.Revit.DB.Analysis.EnergyModelType
This enum is used to define if the energy model is based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Since:
2016

Autodesk.Revit.DB.Analysis.EnergyModelType.AnalysisMode
Energy model based on analysis mode in EnergyDataSettings.